<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CatalogSeeder extends Seeder
{
    public function run(): void
    {
        DB::statement('SET session_replication_role = replica;');
        DB::table('prices')->truncate();
        DB::table('products')->truncate();
        DB::table('groups')->truncate();
        DB::statement('SET session_replication_role = DEFAULT;');

        /* ===================== GROUPS ===================== */

        DB::unprepared("
        INSERT INTO groups (id,id_parent,name) VALUES
        (1,0,'Электроника'),
        (2,0,'Одежда'),
        (3,0,'Бытовая техника'),
        (4,1,'Телефоны и смарт-часы'),
        (5,1,'Компьютеры и комплектующие'),
        (6,2,'Женщинам'),
        (7,2,'Мужчинам'),
        (9,3,'Крупная бытовая техника'),
        (10,3,'Встраиваемая бытовая техника'),
        (11,4,'Смартфоны'),
        (12,4,'Смарт-часы и фитнес-браслеты'),
        (13,5,'Комплектующие для ПК'),
        (14,5,'Моноблоки'),
        (15,5,'Системные блоки'),
        (16,6,'Блузы и рубашки'),
        (17,7,'Брюки'),
        (18,7,'Верхняя одежда'),
        (19,9,'Холодильники'),
        (20,9,'Морозильные камеры'),
        (21,10,'Стиральные машины'),
        (22,10,'Сушильные машины'),
        (23,10,'Посудомойки'),
        (24,12,'Смарт-часы'),
        (25,12,'Фитнес-браслеты'),
        (26,12,'Браслеты и кольца бесконтактной оплаты'),
        (27,13,'Жесткие диски, SSD и сетевые накопители'),
        (28,13,'Видеокарты и графические ускорители'),
        (29,13,'Оперативная память'),
        (30,13,'Материнские платы'),
        (31,13,'Процессоры'),
        (32,16,'Блузы'),
        (33,16,'Рубашки');
        ");

        /* ===================== PRODUCTS ===================== */

        DB::unprepared("
        INSERT INTO products (id,id_group,name) VALUES
        (1,11,'Смартфон Apple iPhone 12 mini 128 ГБ'),
        (2,11,'Смартфон Xiaomi Redmi 9A 2/32 ГБ, серый'),
        (3,11,'Смартфон Xiaomi Redmi Note 11 4/128 ГБ, голубой'),
        (4,11,'Смартфон Xiaomi 12 Pro 12/256 ГБ, фиолетовый'),
        (5,24,'Умные часы Pro Smart Watch 7 / Смарт часы женские, мужские / Фитнес браслет, 44mm'),
        (6,24,'Умные часы Smart Watch 7 Series, 45mm, черный'),
        (7,25,'Фитнес-браслет Xiaomi Mi Band 7, черный'),
        (8,26,'Ремешок для часов фитнес браслета Huawei Watch Fit NEW Elegant , Хуавей вотч фит'),
        (9,26,'Умное кольцо UK2 с поддержкой NFC, размер 8, белое'),
        (10,26,'Смарт-кольцо R5 / Водонепроницаемое пылезащитное / Jakcom IC ID NFC Wear для IOS Android'),
        (11,26,'Jakcom Смарт-кольцо R4 / Водонепроницаемое пылезащитное / IC ID NFC Wear для IOS Android'),
        (12,27,'Кабель переходник USB 3.0 - SATA lll HDD / SSD адаптер'),
        (13,27,'1 ТБ SSD Western Digital Blue SN570'),
        (14,27,'120 ГБ SSD AMD R5 Series'),
        (15,27,'240 ГБ SSD Exegate NextPro'),
        (16,27,'240 ГБ SSD AMD R5 Series 240GB'),
        (17,28,'Видеокарта Colorful GeForce RTX 3080'),
        (18,28,'Устройство видеозахвата EasyCAP'),
        (19,28,'Конвертер PALMEXX HDMI to USB'),
        (20,29,'Оперативная память Compit 8 ГБ'),
        (21,29,'Оперативная память Micron DDR3 4Gb'),
        (22,29,'Оперативная память Kingston 8Gb'),
        (23,30,'Материнская плата Gigabyte Z490M'),
        (24,30,'Материнская плата Gigabyte B560M'),
        (25,30,'Материнская плата Gigabyte H510M'),
        (26,30,'Материнская плата Gigabyte B660M'),
        (27,30,'Материнская плата Gigabyte A320M'),
        (28,31,'Процессор intel i5-12600KF'),
        (29,31,'Процессор AMD Ryzen 5 5600X'),
        (30,31,'Процессор AMD Ryzen 7 7700X'),
        (31,31,'Процессор intel i5-12600K'),
        (32,31,'Процессор XEON E5-2640v3'),
        (33,31,'Процессор Core i3-12100F'),
        (34,31,'Процессор AMD Threadripper 5975WX'),
        (35,32,'Блузка Tom Tailor'),
        (36,32,'Блузка'),
        (37,33,'Рубашка ELIZA group'),
        (38,33,'Рубашка Boutique'),
        (39,33,'Рубашка DOCTOR HOUSE'),
        (40,17,'Брюки EA7 Core Identity'),
        (41,17,'Брюки Dervirgas'),
        (42,17,'Брюки утепленные CEVATS'),
        (43,17,'Брюки спортивные CEVATS'),
        (44,17,'Брюки Soft home'),
        (45,18,'Пальто пуховое Nike'),
        (46,18,'Куртка Hanster'),
        (47,18,'Куртка DSGdong'),
        (48,18,'Пуховик EA7 Core Shield'),
        (49,19,'Морозильный ларь Haier HCE143R'),
        (50,19,'Холодильник Ascoli ARDFRY250'),
        (51,19,'Холодильник БИРЮСА Б-90'),
        (52,19,'Холодильник Hansa FK3356.2DFW'),
        (53,19,'Холодильник БИРЮСА Б-120'),
        (54,19,'Холодильник Candy CCRN 6200W'),
        (55,19,'Холодильник Zarget ZRB 310NS1WM'),
        (56,19,'Холодильник Comfee RCT124WH1R'),
        (57,20,'Морозильный ларь Willmark CF-170CS'),
        (58,20,'Морозильная камера Hyundai CU1007'),
        (59,20,'Морозилка БИРЮСА Б-240KX'),
        (60,20,'Морозильный ларь Willmark CF-250CS'),
        (61,20,'Морозильная камера Comfee RCU102WH1R'),
        (62,20,'Морозильная камера САРАТОВ 153'),
        (63,20,'Морозильный ларь Willmark CF-120CS'),
        (64,20,'Морозилка БИРЮСА Б-285KX'),
        (65,20,'Морозильный ларь Бирюса 355KX'),
        (66,21,'Стиральная машина Weissgauff WMI 6128 D'),
        (67,21,'Стиральная машина Indesit IWUD 4105'),
        (68,21,'Стиральная машина Indesit BI WMIL 71252'),
        (69,22,'Сушильная машина Haier HD90-A2959'),
        (70,22,'Сушильная машина Miele T4859 CiL'),
        (71,23,'Посудомоечная машина Monsher MD 4503'),
        (72,23,'Посудомоечная машина Weissgauff BDW 4004'),
        (73,23,'Посудомоечная машина Weissgauff BDW 6062 D'),
        (74,23,'Посудомоечная машина Kuppersberg GSM 4574'),
        (75,23,'Посудомоечная машина Weissgauff BDW 6042'),
        (76,14,'Моноблок MonoX Shark'),
        (77,14,'Моноблок Alfa computers ALFA-19'),
        (78,14,'Моноблок YB36'),
        (79,15,'Системный блок Matrix i5'),
        (80,15,'Системный блок ALFA комплект'),
        (81,15,'Системный блок KING KOMP RTX 4090'),
        (82,15,'Системный блок Matrix Ryzen 5');
        ");

        /* ===================== PRICES ===================== */

        DB::unprepared("
        INSERT INTO prices (id,id_product,price) VALUES
        (101,1,52490),(102,2,5755),(103,3,16480),(104,4,96990),
        (105,5,1896),(106,6,1843),(107,7,2356),(108,8,259),
        (109,9,308),(110,10,3108),(111,11,1616),(112,12,1019),
        (113,13,12739),(114,14,960),(115,15,1530),(116,16,1542),
        (117,17,61969),(118,18,671),(119,19,941),(120,20,1294),
        (121,21,1409),(122,22,1645),(123,23,11809),(124,24,6373),
        (125,25,5010),(126,26,15539),(127,27,3671),(128,28,21150),
        (129,29,12804),(130,30,36537),(131,31,20822),(132,32,1777),
        (133,33,7336),(134,34,534473),(135,35,3351),(136,36,1100),
        (137,37,1321),(138,38,393),(139,39,1625),(140,40,6620),
        (141,41,2967),(142,42,1289),(143,43,1914),(144,44,924),
        (145,45,4413),(146,46,6128),(147,47,6796),(148,48,14090),
        (149,49,10199),(150,50,33503),(151,51,11417),(152,52,62944),
        (153,53,19340),(154,54,28499),(155,55,33311),(156,56,12990),
        (157,57,16205),(158,58,13837),(159,59,19581),(160,60,21055),
        (161,61,16990),(162,62,17795),(163,63,13137),(164,64,23674),
        (165,65,23700),(166,66,37051),(167,67,19019),(168,68,19628),
        (169,69,69498),(170,70,69999),(171,71,30271),(172,72,24170),
        (173,73,25650),(174,74,33205),(175,75,23492),(176,76,53450),
        (177,77,35500),(178,78,33750),(179,79,86920),(180,80,33800),
        (181,81,419900),(182,82,39810);
        ");
    }
}